#include <pic.h>

/*定时器0初始化配置函数*/
void TIM0_Init()
{
    OPTION_REG=0B00000001;//配置定时器设置寄存器
    GIE=1;//开启总中断
    T0IE=1;//开启定时器0中断
    T0IF=0;//清除定时器0溢出标志位
    TMR0=11;//定时器0计数初值
}

/*定时器1初始化配置函数*/
void TIM1_Init()
{
    GIE=1;//使能总中断
    PEIE=1;//使能第二梯队中断
    TMR1IE=1;//使能定时器1中断
    TMR1IF=0;//清零定时器1中断标志位
    TMR1H=0Xf9;
    TMR1L=0XC0;
    T1CON=0x01; 	
}

/*定时器2初始化配置函数*/
void TIM2_Init()
{
	GIE=1;//开启总中断
	PEIE=1;//开启第二梯队中断
	TMR2IE=1;//开启定时器2中断
	TMR2IF=0;//清空中断标志位
	PR2=124;//周期寄存器赋值
	T2CON=0B01111110;//定时器2控制寄存器
}
